<div id="middle">
    <div id='textArea'>


        <h1 align='right'>О проекте</h1>
        <h2 align='left'>
            Цели проекта
        </h2>
        <span style="color: black;  text-align: left; text-indent: 20px;" >
            <p>Целью разработки проекта является создание общественной платформы по изучению методов ускоренного самообразования и обмен опытом между пользователями в сфере самообучения.</p>
        </span>


        <h2 align='left'>
            Задачи проекта
        </h2>
        <span style="color: black; text-align: justify; text-indent: 20px;" >
            <p> В задачи разработанного проекта входит:</p>
            <list>
            <li>Разаработка веб-приложения для предоставления доступа к учебным материалам, которые расположены на портале;</li>
            <li>Разработка Массового Онлайн Курса (МООК) по изучению методов ускоренного самообразования;</li>
            <li>Предоставление пользователям портала функционала по обмену опытом в области самообучения.</li>
            </list> 
        </span>

        <h2 align='left'>
            Возможности портала
        </h2>
        <span style="color: black; text-align: justify; text-indent: 20px;" >
            <p> Разработанный портал предоставляет следующие возможности :</p>
            <list>
            <li>Прохождение регистрации на портале;</li>
            <li>Выбор учебного курса из существующих курсов;</li>
            <li>Прохождение курса (изучение теоретического материала, тестирование, выполнение заданий и т.д.);</li>
            </list> 
            <p> Разработанное веб-приложение работает на веб-сервере Glassfish Server Open Sourse Edition.</p>
        </span>

        <h2 align='left'>
            Использованные технологии
        </h2>
        <span style="color: black; text-align: justify; text-indent: 20px;" >
            <p> В процессе разработки проекта использовались:</p>
            <list>
            <li>Язык программирования для создания веб-приложений Java Enterprise Edition (JSP);</li>
            <li>СУБД MySql;</li>
            <li>Средстав создания пользовательсокого интерфейса (HTML, CSS, JavaSript).</li>
            </list> 
            <p> Разработанное веб-приложение работает на веб-сервере Glassfish Server Open Sourse Edition.</p>
        </span>



    </div>      

</div>